{
  "projectDetail": [
    {
      "bigTitle" : "Geeks",
      "photoNum" : "0",
      "name": "Geeks 🏠",
      "date": "2023/12 - ING",
      "details": [
        {
          "title": "제작이유 🎤",
          "detail": "대학교 커뮤니티인 ‘에브리타임'에서 매번 룸메이트를 구하는 시즌이 되면 번거롭게 본인의 생활 습관을 하나하나입력하는 학우들을 보며 조금 더 쉽게 룸메이트를 매칭할 수 있는 시스템이 존재하면좋을 것같다는 생각이 들어 해당 플랫폼을 제작하게 되었습니다."
        },{
          "title" : "팀구성 및 역할 👩‍👧‍👧",
          "detail": "백엔드 2명, 프론트엔드 1명, 디자이너 1명\n팀내 유일한 프론트엔드 개발자로 전반적인 프론트엔드 개발 및 백엔드와의 통신을 도맡아 진행했습니다."
        },{
          "title" : "사용기술 🛠️",
          "detail" : "React, styled-components, Axios, Figma, Recoil, Restful API, Lottie, PWA, WebSocket, STOMP",
          "useReason": ["데이터 중복이 발생하지 않고, offset과 다르게 이전 데이터를 읽지않고 다음커서에 정보를 주는 ' 커서기반 페이징 ' 을 구현하여 사용자 경험을 개선시켰습니다.","React가 값을 불러오기 이전 생기는 흰색화면 깜빡임을 없애기 위하여 Lotti를 사용한로딩페이지를 구현하여 사용자 경험을 상승시켰습니다.","다중파일 선택을 사용함과 동시에 예기치않은 많은 파일 전송을 막기위해 전송할 수 있는 파일개수의 개수를 정해주었습니다."]
        },{
          "title" : "배운점 📖",
          "detail" : "기획 부터 배포까지 해당 프로젝트는 유저를 모집한 첫 프로젝트였습니다. 구현에만 초점을 두기보다 커서기반 페이징, 상태관리 등 어떤 방식으로 구현하면 리소스를 덜 차지할지에 관련하여 가장 많이 생각했던 프로젝트였습니다. 또한, 핸드폰 기종에 맞게 '홈화면추가 모달 생성' 과 같이 버튼 하나만 클릭하면 배경화면에 어플처럼 추가가 되도록 하는 등 사용자 경험을 높이기 위하여 노력했던 프로젝트입니다."
        },{
          "title" : "성과 🏆",
          "detail" : "배포한지 이틀만에 40명유저를 확보하였습니다."
        }
      ]
    },{
      "bigTitle" : "OFI",
      "photoNum" : "1",
      "name": "OFI 👗",
      "date": "2023/08 - 2023/09",
      "details": [
        {
          "title": "제작이유 🎤",
          "detail": "옷을 상황별로 잘 입고싶은 사용자들과 패션관련 직무로 나아가기위해 포트폴리오를 쌓을 곳이 마땅하지 않는 사용자들 모두를 만족시키기 위해 해당 플랫폼을 제작하게 되었습니다."
        },{
          "title" : "팀구성 및 역할 👩‍👧‍👧",
          "detail": "백엔드 3명, 프론트엔드 2명, 디자이너 1명\n사용자와 코디네이터 두가지 페이지 중 사용자 페이지의 프론트엔드를 도맡아 진행했습니다."
        },{
          "title" : "사용기술 🛠️",
          "detail" : "React, styled-components, Axios, Figma, Restful API, WebSocket,S3",
          "useReason": ["CSS만 사용하며 스타일 충돌이 빈번하게 일어났던 이전프로젝트의 오류를 해결하기 위하여CSS-in-JS라이브러리 중 하나인 Styled-component를 사용했습니다. 또한, Styled-component를 사용함으로 각 컴포넌트에 대한 스타일을 캡슐화하여 유지보수를 쉽게 만들어주었습니다.","네비게이션 바 아이콘 클릭시 페이지 전환은 되었으나, 아이콘 색이 바뀌지 않는 문제점을 리액트의 로딩방식을 통해 수정하였습니다."]
        },{
          "title" : "배운점 📖",
          "detail" : "짧은 시간 안에 주제 기획 및 수익화 배포 까지 완료했던 프로젝트였습니다. WebSocekt / S3 / Styled-components 등과 같이 처음 마주하는 기술들이 많았음에도 불구하고 팀원들끼리의 협업과 지식 나눔을 통하여 성공적으로 프로젝트를 끝마칠 수 있었던 프로젝트였습니다. 또한, 디자이너와의 커뮤니케이션을 진행하며 사용자에게 보다 편리한 화면구성에 관하여 레퍼런스를 살펴보며 디자인을 수정하며 밀접한 소통을 진행했습니다."
        },{
          "title" : "성과 🏆",
          "detail" : "GDGXWhatever에서 개최한 ‘6주프로덕트 챌린지’에서 최종1등(핵토콘상)을 수상하였습니다."
        }
      ]
    },{
      "bigTitle" : "Portfolio",
      "photoNum" : "2",
      "name": "Portfolio 🖥️",
      "date": "2024/02 - 2024/03",
      "details": [
        {
          "title": "제작이유 🎤",
          "detail": "현재까지 진행했던 프로젝트에 대한 모든 정보를 개인 포트폴리오 웹사이트를 통해 소개하고싶어 제작하게 되었습니다."
        },{
          "title" : "팀구성 및 역할 👩‍👧‍👧",
          "detail": "개인프로젝트"
        },{
          "title" : "사용기술 🛠️",
          "detail" : "React, Emotion, Figma, Vite, JSON, Lottie, Vercel",
          "useReason": ["Webpack을 사용하여 속도가 느렸던 CRA대신에 Esbuild기반으로 제작된 Vite를 사용하였습니다.","JSON으로 내용을 관리하여 중복되는 페이지없이 개발하였습니다."]
        },{
          "title" : "배운점 📖",
          "detail" : "가급적 라이브러리를 사용하지않고 직접 구현하려고 했던 첫 프로젝트였습니다. 라이브러리 대신 직접 구현함으로 어떤 방식대로 진행되는지 몸소 경험할 수있었던 프로젝트였습니다. 또한, JSON을 활용하여 중복되는 페이지를 최소한으로 줄이고 유지보수를 원활하게 하기 위해 노력했습니다."
        }
      ]
    },{
      "bigTitle" : "버스이용률데이터분석및시각화",
      "photoNum" : "3",
      "name": "대학생 대상 버스 이용률 데이터 분석 및 시각화  📈",
      "date": "2023/07 - 2023/08",
      "details": [
        {
          "title": "주제 선정이유 🎤",
          "detail": "천안시 시내버스에 대한 만족도 설문결과와 전국 대학교 분포 데이터를 조사한 결과, 많은 대학교가 천안에 분포하고 있음에도 불구하고 대중교통에 대한 만족도가 현저히 낮은 경향을 발견했습니다. 이로 인해 대학생들의 이동 수단으로서 시내버스에 대한 불편함이 도드라지게 나타났습니다. 이러한 발견을 토대로, 대학생들을 위한 효과적이고 편리한 버스 노선을 개선하기 위한 주제를 선정하게 되었습니다."
        },{
          "title" : "팀구성 및 역할 👩‍👧‍👧",
          "detail": "데이터분석 3명\n역할\n1. 역지오화코딩을 사용하여 전국 대학교 데이터를 히트맵 지도로 표현하여 색깔의 진하기로 각지역별 대학교 수를 확인\n2. 천안시 대학교 위치를 지도에 표시\n3. 크롤링을 사용하여 노선별 배차간격을 파악"
        },{
          "title" : "사용기술 및 사용데이터 🛠️",
          "detail" : "Python, Jupyter notebook\n1. 2022년 전국 대학교 데이터\n2. 천안시 시내버스 만족도\n3. 천안 버스 데이터 크롤링\n4. U+ 가입자의 유동인구 20년 12월"
        },{
          "title" : "배운점 📖",
          "detail" : "1. 데이터 전처리의 중요성\n - 전처리를 통해 원하는 결과를 얻을 수 있으며, 데이터의 정확도와 신뢰성을 높일 수 있었습니다.\n2. 크롤링을 통한 데이터 확보\n - 존재하지않는 데이터들은 크롤링을 통하여 데이터를 수집하였습니다.\n"
        },{
          "title" : "성과 🏆",
          "detail" : "최종 본선 진출"
        }
      ]
    },{
      "bigTitle" : "표정분석을통한v-logbgm추천",
      "photoNum" : "4",
      "name": "표정분석을 통한 v-log bgm 추천 🎧",
      "date": "2022/04 - 2022/07",
      "details": [
        {
          "title": "주제 선정이유 🎤",
          "detail": "코로나 펜데믹으로 인하여 개인 유튜브 채널을 개설하는 사람들이 많아지고 있습니다. 초보 유튜버들이 보다 쉽게 동영상의 BGM을 고를 수 있도록 제작한 서비스입니다."
        },{
          "title" : "팀구성 및 역할 👩‍👧‍👧",
          "detail": "3명\n역할\n1. OpenCV를 통한 얼굴 인식 및 감정 분석\n2. Spotify API를 사용하여 데이터 수집\n3. valence와 energy 예측을 위한 data set 제작"
        },{
          "title" : "사용기술🛠️",
          "detail" : "Python, Spotify API, Colab"
        },{
          "title" : "배운점 📖",
          "detail" : "1. OpenCV와 CNN을 이용한 얼굴인식 및 감정분석\n - OpenCV를 사용하여 업로드한 영상속 인물의 얼굴을 총 7가지 감정으로 분류하였고, 각 프레임별 최고 값을 수치로 저장하여 출력.\n2. 다중선형회귀를 이용한 예측\n - 값을 예측하기 위하여 머신러닝의 지도학습을 사용하였다. 사전에 제작해둔 data set을 사용하여 valence값과 energy값을 예측\n"
        },{
          "title" : "성과 🏆",
          "detail" : "제 11회 대학생 작품경진대회 금상"
        }
      ]
    }
  ]
}
